[
  {
    "RecipeId": 1,
    "AuthorId": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Toasted Bread",
    "Description": "Ingredients:\n- Bread of choice\n- 1 tsp of Butter\n\n1. Place bread in toaster for desired amount of time and remove.\n\n2. Spread butter on hot toast.\n\n3. Eat and Enjoy!",
    "PublishDate": "08-07-2022",
    "EditDate": "25-07-2022",
    "Tags": [],
    "Img": "https://i.imgur.com/8fGqtlE.jpg"
  },
  {
    "RecipeId": 2,
    "AuthorId": 3,
    "FirstName": "Paula",
    "LastName": "McGowran",
    "Title": "Hard Boiled Eggs",
    "Description": "Ingredients:\n- 1 to 6 large eggs\n- 1 tray of ice cubes\n\n1. Place large pot of water on stove at high heat, enough water to cover eggs completely. Carefully lower eggs into pot and continue to boil for 30 seconds. Cover tightly, reduce heat to low (water should maintain a bare simmer), and continue cooking for 11 minutes. Serve immediately if serving hot. If serving cold, immediately place eggs in bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water.\n\n2. To peel, first gently tap hard-boiled eggs all over to thoroughly crack the shell, then remove shell under a thin stream of running water. (The water helps get under the shell and lift it off the egg.)",
    "PublishDate": "12-06-2022",
    "EditDate": "13-06-2022",
    "Tags": [],
    "Img": "https://i.imgur.com/BXxveSO.jpg"
  },
  {
    "RecipeId": 3,
    "AuthorId": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Curried Rice",
    "Description": "- 1 medium onion, finely chopped\n- 3 garlic cloves finely chopped\n- 3 tablespoons olive oil\n- 4 teaspoons curry powder\n- 2 cups long-grain white rice\n- 3 1/4 cups water\n- 2 teaspoons salt\n\n1. Cook onion and garlic in oil in a 3- to 4-quart heavy saucepan over moderately low heat, stirring, until softened. Add curry powder and rice and cook, stirring, 1 minute. Add water and salt and boil, uncovered, without stirring, until surface of rice is covered with steam holes and grains on top appear dry, about 8 minutes.\n\n2. Reduce heat to as low as possible, then cover pan with a tight-fitting lid and cook 15 minutes more.\n\n3. Remove pan from heat and let rice stand, covered, 5 minutes, then fluff with a fork.",
    "PublishDate": "19-05-2022",
    "EditDate": "19-05-2022",
    "Tags": [],
    "Img": "https://i.imgur.com/Ouy7Tw1.jpg"
  },
  {
    "RecipeId": 4,
    "AuthorId": 1,
    "FirstName": "Anthea",
    "LastName": "Tesmond",
    "Title": "Roasted Tomatoes",
    "Description": "- Fresh Tomatoes – washed and quartered\n- Olive Oil\n- Onion – roughly chopped\n- Garlic Cloves\n- Salt and Pepper\n\n1. Begin by preheating the oven to 450 degrees. Line a large baking sheet with parchment paper and place quartered tomatoes onto it. Drizzle olive oil over the tomatoes, then sprinkle on salt and pepper, amount will depend on personal preference.\n\n2. Roast the tomatoes in the oven for approximately 20 minutes, or until they start to brown on top, keep an eye on them so they don’t burn. Remove tomatoes from oven and let cool.\n\n3. Once the tomatoes are fully cooled, transfer them to a Ziploc freezer bag. Label and date the freezer bag and store for up to 6 months.",
    "PublishDate": "23-04-2022",
    "EditDate": "23-04-2022",
    "Tags": [ "Khaki", "Red", "Puce", "Fuscia" ],
    "Img": "https://i.imgur.com/UAAnqx7.jpg"
  },
  {
    "RecipeId": 5,
    "AuthorId": 1,
    "FirstName": "Anthea",
    "LastName": "Tesmond",
    "Title": "Garlic Lemon Green Beans",
    "Description": "- 1 pound green beans fresh, ends trimmed1 tablespoon olive oil\n- 3 garlic cloves finely minced\n- 1 teaspoon lemon juice\n- 2 teaspoons lemon zest\n\n1. Bring a large pot of water to a boil on high heat. Once boiling, add the green beans and cook, boiling, for 3 minutes.\n2. Drain the beans and lay them on a paper towel and gently pat dry.\n3. Heat the olive oil in a large skillet on medium heat. Once hot, add the green beans and garlic. Cooking, stirring often, until the beans just begin to blister. Add the lemon juice and 1 teaspoon of the zest. Cook until the beans are tender but still a bit crunchy.\n4. Sprinkle with remaining zest and serve.",
    "PublishDate": "24-11-2022",
    "EditDate": "24-11-2022",
    "Tags": [ "Yellow", "Orange" ],
    "Img": "https://i.imgur.com/FGLTjFa.jpg"
  }
]

