[
  {
    "Deleted": false,
    "RecipeID": 1,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Prawn and Avocado Omelette",
    "Description": "Your average omelette gets a spring update in this fresh recipe.",
    "Instructions": [
      "Crack the eggs into a mixing bowl, add a tablespoon of milk and a pinch of salt and pepper, and whisk until well beaten.",
      "Heat a large non-stick frying pan over medium heat and add a tablespoon of butter or oil. Swirl the pan to coat the bottom evenly.",
      "Once the butter has melted or oil is hot, pour in the beaten eggs, and let them cook for a minute or until the edges start to set.",
      "Add the sliced avocado, cooked prawns, and grated cheddar cheese to one side of the omelette.",
      "Use a spatula to fold the other side of the omelette over the filling.",
      "Cook for another minute or until the cheese has melted, and the filling is heated through.",
      "Use a spatula to carefully slide the omelette onto a plate.",
      "Season with salt and pepper, to taste.",
      "Serve hot and enjoy your delicious prawn and avocado omelette!"
    ],
    "Ingredients": [
      "8 eggs",
      "¾ cup (180ml) pure cream (or water)",
      "1 cup mixed herbs, chopped (we used chives and parsley), plus extra to serve",
      "1½ tbs ghee",
      "3 spring onions, finely chopped, plus extra thinly sliced to serve",
      "2 zucchini, cut into rounds",
      "1 garlic, crushed",
      "¾ cup frozen peas",
      "2 cups leafy greens, such as baby spinach or chopped silverbeet",
      "12 medium cooked wild prawns, peeled and cleaned",
      "1 avocado, cut into wedges",
      "Thinly sliced green chilli \u0026 lime wedges, to serve"
    ],
    "PublishDate": "",
    "EditDate": "",
    "Tags": [
      "Breakfast",
      "Healthy",
      "Omelette",
      "Prawn"
    ],
    "ImageCaption": null,
    "Img": "https://img.delicious.com.au/TzM-Ms96/w759-h506-cfill/del/2019/10/super-greens-keto-omelette-with-prawn-and-avocado-116259-3.jpg",
    "Comments": [
      {
        "Id": "c60d0581-9a92-4a02-90b8-55f56c862546",
        "FirstName": "John",
        "LastName": "Doe",
        "Comment": "This is a great article!"
      },
      {
        "Id": "d8f2df8d-c79d-4b54-a07e-e44dc4e1c9d1",
        "FirstName": "Jane",
        "LastName": "Smith",
        "Comment": "I found this information very helpful. Thank you!"
      }
    ],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 2,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Katsu Curry",
    "Description": "Katsu Curry (Japanese Curry with Tonkatsu Nuggets and Fried Egg)",
    "Instructions": [
      "Make the curry powder by toasting cardamom pods, cinnamon pieces, bay leaf, mustard seeds, coriander seeds, fennel seeds, cumin seeds, fenugreek seeds, whole cloves, and black peppercorns. Grind the mixture in a spice grinder until a fine powder forms. Add ground ginger, turmeric, salt, paprika, and cayenne, and whisk to combine.",
      "Make the curry by whisking mochiko and broth to form a slurry. Cook onion, ginger, and garlic, then add broth, soy sauce, ketchup, honey, lemon juice, salt, and curry powder. Add the slurry and cook until the mixture thickens. Process the mixture until smooth, season with salt, and simmer for 5 minutes.",
      "Make the quick cucumber pickle by placing cucumbers in a bowl with sugar and salt. Pour out excess brine, add lemon juice, and toss to combine.",
      "Make the tonkatsu nuggets by heating oil in a Dutch oven, then trimming and flattening pork chops. Dredge in flour, egg, and panko, then fry until golden brown. Transfer to a paper towel-lined plate.",
      "Reheat the curry and divide rice among bowls. Spoon the curry over half of each bowl and place the tonkatsu nuggets on the other half. Top with shredded cabbage, lemon wedges, cilantro, and a fried egg. Serve with the quick cucumber pickle."
    ],
    "Ingredients": [
      "2 to 3 cardamom pods",
      "1 (2-inch) cinnamon stick, broken into small pieces",
      "1 dried bay leaf",
      "1 tablespoon brown or black mustard seeds",
      "1 tablespoon coriander seeds",
      "1 tablespoon fennel seeds",
      "1 tablespoon cumin seeds",
      "1 teaspoon fenugreek seeds",
      "1/2 teaspoon whole cloves",
      "1 1/2 teaspoons black peppercorns",
      "1 tablespoon ground ginger",
      "1 tablespoon ground turmeric",
      "1 tablespoon fine sea salt",
      "1 teaspoon sweet paprika",
      "1 teaspoon cayenne pepper, plus more to taste"
    ],
    "PublishDate": " ",
    "EditDate": "",
    "Tags": [
      "Lunch",
      "Japanese",
      "Rice",
      "Curry",
      "Fried"
    ],
    "ImageCaption": null,
    "Img": "https://www.foodandwine.com/thmb/hicXzmGIIpkwyX3Q55IYiupQjMo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Katsu-Curry-Japanese-Curry-with-Tonkatsu-Nuggets-and-Fried-Egg-FT-RECIPE0922-2000-bd3fa359de3544448906652f53f53bb3.jpg",
    "Comments": [
      {
        "Id": "c60d0581-9a92-4a02-90b8-55f56c862546",
        "FirstName": "John",
        "LastName": "Doe",
        "Comment": "This is a great article!"
      },
      {
        "Id": "d8f2df8d-c79d-4b54-a07e-e44dc4e1c9d1",
        "FirstName": "Jane",
        "LastName": "Smith",
        "Comment": "I found this information very helpful. Thank you!"
      }
    ],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 3,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Beef Taco",
    "Description": "Elevate a pack of beef mince into vibrant tacos. Go to the extra effort of making your own spice mix for even more flavour, and use soft tortillas",
    "Instructions": [
      "Prepare the spice mix by toasting and grinding cumin seeds, coriander seeds, and peppercorns. Add remaining ingredients, mix with cornflour and salt, and store in an airtight jar.",
      "Make pickled onions by mixing sliced onions with lime juice and salt, and letting them soften.",
      "Brown minced beef in oil until crispy, then add half of the spice mix and cook for another 2 minutes. Pour in beef stock, reduce heat to simmer, and cook for 10 minutes until thick and rich. Season to taste.",
      "Toast tortillas and serve with the beef mixture, pickled onions, avocado, tomato, cheese, and tortilla chips (optional) in separate bowls for people to assemble their own tacos. Serve with lime wedges."
    ],
    "Ingredients": [
      "1 tbsp sunflower oil",
      "500g beef mince",
      "300ml beef stock",
      "2 tbsp cumin seeds",
      "1 tbsp coriander seeds",
      "1 tsp black peppercorns",
      "1 tsp chipotle chilli flakes",
      "1 tbsp paprika",
      "1 tbsp dried oregano",
      "1 tsp garlic granules",
      "1 tsp onion granules",
      "2 tsp cornflour",
      "1 large red onion, finely sliced",
      "1 lime, juiced, plus wedges to serve"
    ],
    "PublishDate": " ",
    "EditDate": "",
    "Tags": [
      "Mexican",
      "Taco",
      "Appetizers"
    ],
    "ImageCaption": null,
    "Img": "https://images.immediate.co.uk/production/volatile/sites/30/2021/02/Next-level-tacos-e163429.jpg?quality=90\u0026webp=true\u0026resize=600,545",
    "Comments": [
      {
        "Id": "c60d0581-9a92-4a02-90b8-55f56c862546",
        "FirstName": "John",
        "LastName": "Doe",
        "Comment": "This is a great article!"
      },
      {
        "Id": "d8f2df8d-c79d-4b54-a07e-e44dc4e1c9d1",
        "FirstName": "Jane",
        "LastName": "Smith",
        "Comment": "I found this information very helpful. Thank you!"
      }
    ],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 4,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Classic Korean Bibimbap",
    "Description": "Rice mixed with vegetables, meat, an egg, and chili pepper paste",
    "Instructions": [
      "Gather the ingrediants",
      "To begin, you\u0027ll need to cook the rice in a rice cooker or on the stove.",
      "Next, give the cucumber strips a salt water bath for 20 minutes.",
      "Drain the cucumber strips using a sieve.",
      "Then, season spinach with 2 teaspoons sesame oil, 1/2 teaspoon of salt, and 1 dash of the sesame seeds.",
      "Season bean sprouts with 2 teaspoons sesame oil, the remaining 1/2 teaspoon salt, and the remaining dash of sesame seeds.",
      "Add a drizzle of oil to a pan over medium-high heat. Sauté the carrots with a dash of salt until tender, but still crunchy, about 2 minutes. Remove from pan and set aside.",
      "Next, sauté the mushrooms with a dash of salt, adding more oil if needed. Cook until soft and lightly browned, about 5 minutes. Remove from pan and set aside.",
      "Add a drizzle of oil to the pan. Sauté the zucchini with a dash of salt until tender, about 4 minutes.",
      "Place the cooked rice in a large bowl and arrange vegetables on top.",
      "If desired, meat, egg, or both can be placed in the center."
    ],
    "Ingredients": [
      "2 cups medium-grain rice",
      "1 large cucumber, sliced into thin strips",
      "1 teaspoon salt, divided, more as needed",
      "1 1/2 cups parboiled spinach, squeezed of excess water",
      "4 teaspoons sesame oil, divided, more as needed",
      "2 dashes sesame seeds, divided",
      "1 1/2 cups blanched mung bean sprouts, squeezed of excess water",
      "2 medium carrots, julienned",
      "10 shiitake mushrooms, rehydrated if dried, sliced",
      "1 medium zucchini, sliced into thin strips",
      "1/2 pound meat, optional",
      "Fried or medium-soft boiled eggs, optional",
      "Gochujang, or red pepper paste, for serving"
    ],
    "PublishDate": " ",
    "EditDate": "",
    "Tags": [
      "Korean",
      "Lunch",
      "Fusion ",
      "Rice"
    ],
    "ImageCaption": null,
    "Img": "https://www.thespruceeats.com/thmb/r2bG-lIQYgLYecbnwOW36hiLuk8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/classic-korean-bibimbap-recipe-2118765-hero-01-091c0e0f8c20426d8f70747955efa61d.jpg",
    "Comments": [
      {
        "Id": "c60d0581-9a92-4a02-90b8-55f56c862546",
        "FirstName": "John",
        "LastName": "Doe",
        "Comment": "This is a great article!"
      },
      {
        "Id": "d8f2df8d-c79d-4b54-a07e-e44dc4e1c9d1",
        "FirstName": "Jane",
        "LastName": "Smith",
        "Comment": "I found this information very helpful. Thank you!"
      }
    ],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 5,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Healthy Salad Sandwich",
    "Description": "This salad sandwich with herb mayo is the perfect quick and easy brunch recipe. Use any fresh vegetables you have to make a delicious, filling meal.",
    "Instructions": [
      "Make the herb mayo: Combine the mayonnaise (or yogurt) with lemon juice, fresh herbs, salt and pepper. Blend with an immersion blender or food processor until smooth then set aside.",
      "Prep the vegetables: Thinly slice the tomato, cucumber and red onion and julienne the cucumber.",
      "Assemble the sandwich: Spread a generous amount of the herb mayo onto two slices of bread then top with all your prepped vegetables and cheese. Slice and serve."
    ],
    "Ingredients": [
      "Bread",
      "Freshly salad vegetables",
      "Cheese",
      "Mayonnasie",
      "Fresh herbs",
      "Lemon juice",
      "Salt and pepper"
    ],
    "PublishDate": " ",
    "EditDate": "",
    "Tags": [
      "Sandwich",
      "Breakfast",
      "Healthy",
      "Bread",
      "Easy",
      "Quick"
    ],
    "ImageCaption": null,
    "Img": "https://simply-delicious-food.com/wp-content/uploads/2020/07/Easy-salad-sandwiches-with-herb-mayo-1.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 6,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Vietnamese Fresh Spring Rolls",
    "Description": "Traditional Vietnamese fresh spring rolls (goi cuon) consist of pork, shrimp, lettuce and herbs wrapped in soft chewy rice paper. They are beautiful to look at and great as a refreshing appetizer or even a light meal. Your guests will be impressed!",
    "Instructions": [
      "Parboil the pork for a minute, then discard the liquid.",
      "In a clean pot, add ginger, salt, pork, and enough water to cover the pork. Bring to a boil and skim off any foam. Lower heat to maintain a simmer and place the lid slightly askew. Cook for 25-30 minutes until the pork is just cooked through. Transfer to a bowl with iced water to stop the cooking.",
      "Poach the shrimp in boiling water for 2 minutes until they are just cooked through. Place them in a bowl with iced water immediately.",
      "Slice the pork thinly and slice the shrimp in half lengthwise (remove the veins if needed).",
      "Set up a work station with all ingredients and a plate/bowl of clean water. Briefly dip one rice paper wrapper into the water to wet it just enough to make it pliable and then lay it flat.",
      "Add a layer of lettuce, fresh herbs, and vermicelli noodles. Fold left and right corners of the rice paper over the filling.",
      "Place a couple of pork slices right above the veggies and noodles (about the middle of the rice paper) and place two of the shrimp halves above the pork slices (about the top part of the rice paper). Then roll it up away from you.",
      "Place on a serving plate with the shrimp side up. Repeat with remaining filling and wrappers.",
      "Serve immediately with a dipping sauce."
    ],
    "Ingredients": [
      "10 oz pork (choose among pork shoulder, tenderloin or pork belly)",
      "1 thumb-sized piece of ginger",
      "1/2 teaspoon salt",
      "1 lb raw shrimp (I use peel-on shrimp. We need 16 of them)",
      "16 rice paper wrappers (8.5\u0027\u0027-9\u0027\u0027 in diameter)",
      "2 cups soft lettuce, cut into smaller pieces or strips",
      "Basil, tough stems removed",
      "Chives, cut into 3\u0027\u0027-4\u0027\u0027 long pieces",
      "Other fresh herbs of your choice such as cilantro, mint",
      "8 oz cooked rice vermicelli"
    ],
    "PublishDate": " ",
    "EditDate": " ",
    "Tags": [
      "Vietnamese",
      "Easy",
      "Appetizers",
      "Quick"
    ],
    "ImageCaption": null,
    "Img": "https://delightfulplate.com/wp-content/uploads/2020/07/Traditional-Vietnamese-Fresh-Spring-Rolls-Goi-cuon-tom-thit.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 7,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Homemade Hotpot",
    "Description": "Hot pot is a tasty, festive and communal cooking and dining experience that involves little more than a table set with a portable butane stove, a pot of bubbling broth and platters of raw meat and/or seafood and vegetables.",
    "Instructions": [
      "In a large pot, bring 5 quarts of water to a boil. Add the pork bones and boil for 10 minutes. Drain the pork bones and rinse them with cold water. Clean the pot and rinse it with cold water.",
      "Return the pork bones to the clean pot and add enough water to cover the bones by 2 inches. Add the carrot, corn, and daikon. Bring to a boil and then reduce the heat to a simmer. Skim the foam and impurities from the surface of the broth.",
      "Add 1 tablespoon of salt to the pot and continue to simmer for 2-3 hours, until the broth is rich and flavorful. Add more salt if needed.",
      "Strain the broth through a fine-mesh strainer into a clean pot. Discard the solids.",
      "To serve, arrange the thinly sliced beef, fish, Napa cabbage, spinach, potato, pumpkin, eggs, tofu, and udon noodles on plates or in bowls.",
      "Bring the hot pot broth to a boil and pour it into a hot pot or a large pot. Set the pot over a portable burner at the dining table.",
      "Each person can then cook their own ingredients in the hot pot. Serve with the dipping sauces and condiments of your choice."
    ],
    "Ingredients": [
      "2 pounds (or 2 each) pork leg bones, cut into 2-inch pieces",
      "1 carrot, peeled and cut into 1-inch chunks",
      "1 ear corn, husks and silks removed and cut into 1-inch pieces",
      "1 small daikon (about 1/2 pound), peeled and cut into 1-inch chunks",
      "Kosher salt",
      "1/4 cup chili oil",
      "1 pound thinly sliced beef",
      "1 pound of any white-fleshed fish, such as flounder, cod, haddock, etc., cut into 1-inch cubes",
      "1/2 pound Napa cabbage, cut into bite-size pieces",
      "1/2 bunch spinach (about 1/2 pound)",
      "1 large Yukon gold or russet potato, peeled and cut into 1/2-inch slices",
      "1 small pumpkin, halved, seeded and cut into 1/2-inch slices",
      "4 large hard-boiled eggs, peeled",
      "One 8-ounce package fish tofu or one 12-ounce package extra-firm tofu (cut the regular tofu into 1/2-inch slices)",
      "One 8-ounce package udon noodles",
      "Hot Pot dipping sauce: Chinese BBQ sauce, Chilli oil, Oyster sacuce, Sesame paste"
    ],
    "PublishDate": " ",
    "EditDate": " ",
    "Tags": [
      "Chinese",
      "Soup",
      "Spicy",
      "Mixed"
    ],
    "ImageCaption": null,
    "Img": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2021/03/18/0/FNK_HOT_POT_AT_HOME_OPENER_H_f_s4x3.jpg.rend.hgtvcom.826.620.suffix/1616107469470.jpeg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 8,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Thai Basil and Cilantro Salad",
    "Description": "Thai basil and cilantro salad",
    "Instructions": [
      "Combine cucumbers, shallots and carrots in a medium bowl.",
      "Bring vinegar, sugar and salt to a boil in a small saucepan over medium-high, then pour over vegetables. Toss to coat. Set aside, stirring occasionally, for 15 min",
      "Add basil, cilantro and chili to vegetables and toss to coat. Serve with grilled satay tofu skewers."
    ],
    "Ingredients": [
      "6 mini cucumbers, thinly sliced",
      "3 shallots, thinly sliced",
      "1 285-g pkg carrots, cut into matchsticks (3 cups)",
      "1/2 cup vinegar",
      "3 tbsp brown sugar",
      "3/4 tsp salt",
      "3 cups packed small Thai basil leaves, (or coarsely torn)",
      "3 cups packed cilantro leaves",
      "1 red chili, thinly sliced (optional)"
    ],
    "PublishDate": " ",
    "EditDate": "",
    "Tags": [
      "Thai",
      "Salad",
      "Healthy",
      "Green",
      "Appetizers",
      "Breakfast",
      "Vegan",
      "Vegetarian"
    ],
    "ImageCaption": null,
    "Img": "https://chatelaine.com/wp-content/uploads/2018/06/Thai-basil-and-cilantro-salad-800x800.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 9,
    "AuthorID": 4,
    "FirstName": "Jenna",
    "LastName": "Urben",
    "Title": "Vegan Acai Bowl",
    "Description": "The best Acai Bowl is a thick and creamy smoothie made with acai berry and served in a bowl with a variety of delicious toppings. It’s packed with nutrition and easy to make!",
    "Instructions": [
      "In a blender, place the berries, banana, acai powder, optional protein source and water/milk. Blend until smooth. Add extra water if needed (most likely you won’t need any).",
      "Place in serving bowl and top with the suggested toppings or your favorite assortment.",
      "Serves 1 large or 2 small"
    ],
    "Ingredients": [
      "1 cup frozen berry mix (any combo: blackberries, blueberries, strawberries, raspberries)",
      "1 large banana (sliced and frozen)",
      "1 tablespoon acai berry powder or 1 packet frozen acai puree",
      "3/4 – 1 cup unsweetened non-dairy milk or water, \u002B more as needed",
      "1 tablespoon nut butter, optional for protein",
      "Mix of fresh berries and fruit",
      "Granola",
      "Toasted coconut flakes",
      "Chia seeds and/or hemp hearts"
    ],
    "PublishDate": "15-07-2019",
    "EditDate": "15-07-2019",
    "Tags": [
      "Vegan",
      "Acai",
      "Smoothie",
      "Granola",
      "Fresh",
      "Fruit",
      "healthy",
      "breakfast",
      "vegetarian"
    ],
    "ImageCaption": null,
    "Img": "https://simple-veganista.com/wp-content/uploads/2016/04/homemade-acai-bowl-7.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 10,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Toasted Bread",
    "Description": "Delicious Toasted Bread!",
    "Instructions": [
      "Place bread in toaster for desired amount of time and remove.",
      "Spread butter on hot toast.",
      "Eat and Enjoy!"
    ],
    "Ingredients": [
      "Bread of choice",
      "1 tsp of butter"
    ],
    "PublishDate": "08-07-2022",
    "EditDate": "25-07-2022",
    "Tags": [
      "Bread",
      "Breakfast",
      "Quick",
      "Easy"
    ],
    "ImageCaption": null,
    "Img": "https://www.optimistdaily.com/wp-content/uploads/shutterstock_774365320-e1614177159300.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 11,
    "AuthorID": 2,
    "FirstName": "Serge",
    "LastName": "Swinden",
    "Title": "Curried Rice",
    "Description": "Curried rice is a comforting dish that you can whip together with your pantry staples at a moment\u0027s notice.",
    "Instructions": [
      "Cook the Vegetables. Heat the oil in a large pan to medium heat.",
      "Add the onion, peppers and carrots, and cook for 5 minutes to soften.",
      "Add the Seasonings. Add the garlic and ginger paste and seasonings (add curry powder, coriander, paprika, cumin, turmeric, cardamom, salt and pepper). Stir to coat. Cook, stirring for 1 minute.",
      "Simmer the Rice. Add the rice and stock and stir.",
      "Bring to a boil, then reduce heat, cover and simmer for 15 minutes, or until the rice has absorbed the liquid and is tender to your preference. If the rice is not done enough, add a bit more water and stock and simmer longer.",
      "Fluff and Garnish. Remove from heat and fluff with a fork. Sprinkle with garam masala, chili flakes, fresh chopped parsley, and serve."
    ],
    "Ingredients": [
      "Vegetable oil",
      "Vegetables: Onion, bell pepper, carrot. I like to add in spicier peppers",
      "Ginger-Garlic paste",
      "Seasonings: Yellow curry powder, ground coriander, paprika, cumin, turmeric, cardamom, salt, and black pepper. Garam masala is added at the end.",
      "Long Grain Rice: Basmati rice or jasmine rice",
      "Water or Stock (or Broth): Chicken broth or vegetable broth is preferred for more flavor, but water is also suitable with the amount of spices used.",
      "Garnish: Red chili flakes, fresh chopped parsley, lemon"
    ],
    "PublishDate": "19-05-2022",
    "EditDate": "19-05-2022",
    "Tags": [
      "Curry",
      "Rice",
      "Lunch"
    ],
    "ImageCaption": null,
    "Img": "https://cookingformysoul.com/wp-content/uploads/2022/03/curry-fried-rice-feat-min.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 12,
    "AuthorID": 2,
    "FirstName": " ",
    "LastName": " ",
    "Title": "Crossing the Bridge Rice Noodles",
    "Description": "Enjoy this special Chinese rice noodle soup. A chicken and pork broth is infused with ginger and spices, and poured over noodles, veg, prawns and shredded meat.",
    "Instructions": [
      "In a large stockpot bring 1 litre of water to the boil. Add the pork ribs and chicken thighs, and simmer for 15 mins, skimming off any impurities.",
      "Discard the water and drain the meat. Clean the stockpot, then add 2 litres water and return the meat to the pot. Add two pinches of salt and the ground white pepper, ginger, star anise, Szechuan peppercorns and spring onions. Bring to the boil, then simmer, covered, over a medium heat for 1 hr.",
      "Meanwhile, prepare all the condiments by putting them in small dipping bowls.",
      "Once the stock is ready, remove the ribs and chicken and shred the meat using two forks. Strain the stock and discard the spices, spring onions and ginger. Bring the stock to the boil.",
      "Divide the noodles between two large, wide bowls. Garnish around the noodles with the bean curd skin, mushrooms, spring onions, chillies, shallots, Romaine lettuce, spinach, tiger prawns and coriander. Add the shredded cooked meats. Ladle the hot stock over each bowl, covering all the ingredients.",
      "Serve with the condiments and season with your favourites. Eat the noodles, then drink the soup broth at the end."
    ],
    "Ingredients": [
      "4 pork spare ribs",
      "4 chicken thighs, skin removed",
      "2 pinches of ground white pepper",
      "1 thumb-sized piece ginger, peeled and sliced",
      "1 star anise",
      "1 tbsp Szechuan peppercorns",
      "4 spring onions, trimmed and chopped into 2.5cm slices",
      "2 nests cooked vermicelli rice noodles, drizzled with toasted sesame oil",
      "4 pieces bean curd skin",
      "2 large King Trumpet or King Oyster mushrooms, sliced lengthways",
      "1 small handful of rehydrated Wood Ear mushroom strips",
      "2 spring onions, sliced on the angle",
      "2 red chillies, deseeded and finely sliced",
      "1 shallot, peeled and finely sliced",
      "1 Romaine lettuce, chopped into 2.5cm slices",
      "1 large handful baby spinach",
      "10 large cooked tiger prawns, deveined",
      "1 small bunch of coriander, chopped",
      "2 tbsp freshly sliced chillies in 4 tbsp low-salt light soy sauce",
      "2 tbsp Chinkiang black rice vinegar",
      "1 tbsp roasted ground Szechuan peppercorns",
      "1 tbsp chilli flakes mixed with 1 tbsp sea salt flakes",
      "2 tbsp hoisin sauce",
      "2 tbsp chilli garlic sauce"
    ],
    "PublishDate": " ",
    "EditDate": "",
    "Tags": [
      "Noodles",
      "Chinese",
      "Soup",
      "Lunch"
    ],
    "ImageCaption": null,
    "Img": "https://images.immediate.co.uk/production/volatile/sites/30/2021/12/Crossing-The-Bridge-Noodles-c951e67.jpg?quality=90\u0026webp=true\u0026resize=600,545",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 13,
    "AuthorID": 1,
    "FirstName": "Anthea",
    "LastName": "Tesmond",
    "Title": "Roasted Tomatoes",
    "Description": "Roasting tomatoes brings out their natural sweetness and intensifies their flavor, making them a versatile ingredient in many dishes. It\u0027s also a great way to use up extra tomatoes if you have an abundance of them from your garden or farmer\u0027s market.",
    "Instructions": [
      "Gather the ingredients. Position a rack in the center of the oven and heat to 450 F.",
      "In a small bowl, combine the oil, vinegar, and garlic. Set aside to let the garlic infuse the liquids while you prepare the tomatoes.",
      "Cut the tomatoes in half lengthwise. Line a medium rimmed baking sheet with foil. Put the tomatoes in the pan, cut side up.",
      "Drizzle the garlic-infused vinegar and oil evenly over the tops of the tomatoes. Season with pepper and salt to taste.",
      "Roast until the tomatoes are tender and golden in places, 20 to 30 minutes.",
      "Once cool, refrigerate the tomatoes in an airtight container for up to 4 days. Reheat in a 400 F oven for about 10 minutes.",
      "To freeze, place the cooled tomatoes in a single layer on a plastic-lined sheet pan, Freeze until solid. Remove from the pan and store in a zip-top freezer bag or container, and use within six months."
    ],
    "Ingredients": [
      "1 tablespoon olive oil",
      "2 teaspoons balsamic vinegar",
      "1 medium clove garlic, minced",
      "6 medium plum tomatoes",
      "1/4 teaspoon freshly ground black pepper, more to taste",
      "1/4 teaspoon kosher salt, more to taste"
    ],
    "PublishDate": "23-04-2022",
    "EditDate": "23-04-2022",
    "Tags": [
      "Appetizers",
      "Vegan",
      "Puce",
      "Fuscia",
      "Healthy",
      "Easy",
      "Khaki",
      "Vegetarian"
    ],
    "ImageCaption": null,
    "Img": "https://i.imgur.com/UAAnqx7.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 14,
    "AuthorID": 3,
    "FirstName": "Paula",
    "LastName": "McGowran",
    "Title": "Hard Boiled Eggs",
    "Description": "Hard boiled eggs are a simple and classic recipe that involves boiling eggs until the egg whites are set and the yolks are cooked to your desired level of firmness. This recipe is perfect for breakfast, snacks, or as a topping for salads or sandwiches.",
    "Instructions": [
      "Place large pot of water on stove at high heat, enough water to cover eggs completely.",
      "Carefully lower eggs into pot and continue to boil for 30 seconds.",
      "Cover tightly, reduce heat to low (water should maintain a bare simmer), and continue cooking for 11 minutes.",
      "Serve immediately if serving hot. If serving cold, immediately place eggs in bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water.",
      "To peel, first gently tap hard-boiled eggs all over to thoroughly crack the shell,then remove shell under a thin stream of running water. (The water helps get under the shell and lift it off the egg.)"
    ],
    "Ingredients": [
      "1 to 6 large eggs",
      "1 tray of ice cubes"
    ],
    "PublishDate": "12-06-2022",
    "EditDate": "13-06-2022",
    "Tags": [
      "Breakfast",
      "Healthy",
      "Quick",
      "Easy"
    ],
    "ImageCaption": null,
    "Img": "https://i.imgur.com/BXxveSO.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 15,
    "AuthorID": 1,
    "FirstName": "Anthea",
    "LastName": "Tesmond",
    "Title": "Garlic Lemon Green Beans",
    "Description": "Green beans are sautéed with garlic, red pepper flakes, and butter, then finished with lemon zest and salt and pepper to create a flavorful and easy side dish.",
    "Instructions": [
      "Blanch green beans in a large stock pot of well salted boiling water until bright green in color and tender crisp, roughly 2 minutes. Drain and shock in a bowl of ice water to stop from cooking.",
      "Heat a large heavy skillet over medium heat. Add the oil and the butter. Add the garlic and red pepper flakes and saute until fragrant, about 30 seconds. Add the beans and continue to saute until coated in the butter and heated through, about 5 minutes. Add lemon zest and season with salt and pepper."
    ],
    "Ingredients": [
      "2 pounds green beans, ends trimmed",
      "1 tablespoon extra-virgin olive oil",
      "3 tablespoons butter",
      "2 large garlic cloves, minced",
      "1 teaspoon red pepper flakes",
      "1 tablespoon lemon zest",
      "Salt and freshly ground black pepper"
    ],
    "PublishDate": "24-11-2022",
    "EditDate": "24-11-2022",
    "Tags": [
      "Healthy",
      "Lunch",
      "Vegan",
      "Vegetarian"
    ],
    "ImageCaption": null,
    "Img": "https://www.tastingtable.com/img/gallery/lemon-garlic-green-beans-recipe/l-intro-1648589949.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 16,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "Unagi Don ",
    "Description": "Grilled eel rice bowl.  ‘Unagi’ is the Japanese word for ‘eel’, and this particular one-bowl donburi dish tops servings of white rice with fillets of freshly grilled eel, all seasoned with a homemade unagi sauce.",
    "Instructions": [
      "Make the unagi sauce",
      "Prepare the rice",
      "Grill the unagi",
      "Add the unagi sauce",
      "Serve and enjoy!"
    ],
    "Ingredients": [
      "200g rice",
      "260 ml water",
      "2 eel fillets, skin-on",
      "4 tbsp soy sauce",
      "2 ½ tbsp sugar",
      "1 ½ tbsp cooking sake",
      "4 tbsp mirin"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Japanese",
      "Lunch",
      "Rice",
      "Eel"
    ],
    "ImageCaption": null,
    "Img": "https://cdn.media.amplience.net/i/japancentre/recipe-1434-unagi-don-grilled-eel-rice-bowl/recipe-1434-unagi-don-grilled-eel-rice-bowl?$poi$\u0026w=700\u0026h=410\u0026sm=c\u0026fmt=auto",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 17,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "Chicken Tikka Masala ",
    "Description": "It’s a rich and flavorful Indian chicken curry where pieces of chicken are marinated in yogurt and spices.",
    "Instructions": [
      "Marinate the chicken. In a mixing bowl or a Ziploc bag, mix the chicken with yogurt and masala paste (recipe can be found in the recipe card if you scroll down – it’s very simple!). Let it marinate in the fridge for at least 15 minutes if you’re in a hurry, and preferably for an hour or up to 24 hours. The marinating process will allow the chicken to absorb all of the flavors, and become really tender and delicious (the longer the better!).",
      "On the Instant Pot press on SAUTE and heat the oil, when a HOT message is displayed add the marinated chicken. Work in batches and brown the chicken on both sides (not cooking it all the way through, just browning it a little on each side), then switch off the saute setting.",
      "Deglaze the pot with a little bit of water, or the tomato sauce that you will add in the next step to avoid the burn message.",
      "Add the passata or tomato sauce, 2 tablespoons of the masala paste, and salt. Give it a quick mix.",
      "Secure the lid and set the vent to SEALING. Select the PRESSURE COOK/MANUAL setting and set the cooking time for 4 minutes at high pressure. The Instant Pot will take around 10 minutes to come to pressure and start cooking. When the cooking program ends, quickly release the steam.",
      "Carefully open the lid, and push the SAUTE button. Stir in the cream, and allow the sauce to reduce a little. Switch off the SAUTE.",
      "Serve warm over basmati rice, or Indian jeera cumin rice with chopped fresh parsley, mint or cilantro leaves."
    ],
    "Ingredients": [
      "Chicken thighs",
      "Yogurt",
      "Masala paste",
      "Vegetable oil",
      "Passata or tomato sauce",
      "Whipping cream or coconut milk",
      "Salt"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Indian",
      "Lunch",
      "Chicken",
      "Rice"
    ],
    "ImageCaption": null,
    "Img": "https://littlesunnykitchen.com/wp-content/uploads/Chicke-tikka-masala-2-7-730x1095.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 18,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "Guacamole",
    "Description": "If you need a last-minute appetizer for a cookout this weekend, make this guacamole recipe!",
    "Instructions": [
      "Dice the red onion, cilantro, and jalapeño, and zest and juice the limes. Slice each avocado in half lengthwise, and carefully remove the pit. Score the avocado flesh in a grid pattern, and use a spoon to scoop it into a large bowl.",
      "Add the remaining ingredients, and gently mash with a fork or a potato masher to reach your desired consistency. ",
      "Season to taste, and enjoy!"
    ],
    "Ingredients": [
      "Avocado",
      "Red onion",
      "Cilantro",
      "Lime juice and zest",
      "Jalapeño",
      "Salt"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Healthy",
      "Appetizers",
      "Vegan",
      "Vegetarian",
      "Mexican"
    ],
    "ImageCaption": null,
    "Img": "https://cdn.loveandlemons.com/wp-content/uploads/2019/04/guacamole-recipe-580x832.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 19,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "New England Clam Chowder",
    "Description": "This is the best New England clam chowder recipe, ever! In the Pacific Northwest, we dig our own razor clams and I grind them for the chowder. Since these aren\u0027t readily available, the canned clams are perfectly acceptable",
    "Instructions": [
      "In a Dutch oven, cook bacon over medium heat until crisp. Remove to paper towels to drain; set aside. Saute celery and onion in the drippings until tender. Add garlic; cook 1 minute longer. Stir in the potatoes, water, clam juice, bouillon, pepper and thyme. Bring to a boil. Reduce heat; simmer, uncovered, until potatoes are tender, 15-20 minutes.",
      "In a small bowl, combine flour and 1 cup half-and-half until smooth. Gradually stir into soup. Bring to a boil; cook and stir until thickened, 1-2 minutes.",
      "Stir in clams and remaining half-and-half; heat through (do not boil). Crumble the cooked bacon; sprinkle over each serving."
    ],
    "Ingredients": [
      "4 center-cut bacon strips",
      "2 celery ribs, chopped",
      "1 garlic clove, minced",
      "3 small potatoes, peeled and cubed",
      "1 bottle (8 ounces) clam juice",
      "3 teaspoons reduced-sodium chicken bouillon granules",
      "1/4 teaspoon white pepper",
      "1/4 teaspoon dried thyme",
      "2 cups fat-free half-and-half, divided",
      "2 cans (6-1/2 ounces each) chopped clams, undrained"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Soup",
      "England"
    ],
    "ImageCaption": null,
    "Img": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/Contest-Winning-New-England-Clam-Chowder_EXPS_FT20_41095_F_0623_1.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 20,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "French Bread Pizza",
    "Description": "The easiest way to make pizza at home, and it’s ready in no time! Made with soft yet hearty French bread, robust, garlicky and herby pizza sauce, two types of rich cheese and all your favorite toppings!",
    "Instructions": [
      "Prepare oven, and baking sheet: Move oven rack up one level and preheat oven to 425 degrees. Line a rimmed 18 by 13-inch baking sheet with aluminum foil for easier clean up if desired.",
      "Cut bread: Cut french bread in half evenly through the length, to create two long portions. Cut each portion in half and place on baking sheet.",
      "Brush bread with oil, lightly toast: Brush both sides with olive oil. Turn upright and bake in preheat oven 4 minutes.",
      "Add toppings: Spread pizza sauce over each piece, sprinkle evenly with mozzarella and parmesan cheeses, then finish with desired toppings.",
      "Bake again: Bake in preheated oven until cheese is fully melted, about 10- 13 minutes. If you’d like it more browned then broil during the last 1 minute or so (keep a close eye on it!)."
    ],
    "Ingredients": [
      "French bread",
      "Pizza sauce",
      "Mozzarella ",
      "Parmesan cheese",
      "Olive oil"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Bread",
      "Easy",
      "French"
    ],
    "ImageCaption": null,
    "Img": "https://www.cookingclassy.com/wp-content/uploads/2020/08/french-bread-pizza-14.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 21,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "Healthy Tuna Salad",
    "Description": "This Healthy Tuna Salad is so filling and flavorful. Crisp vegetables tossed with beans and tuna and a citrusy dressing make this a guilt-free and scrumptious alternative to this classic dish.",
    "Instructions": [
      "Prepare the ingredients by chopping, cutting, and dicing the vegetables and herbs in this Healthy Tuna Salad. Then rinse and drain the beans, as well as the tuna.",
      "Place all of the ingredients into a large mixing bowl, including the lemon juice and oil. Mix well. Season with salt and pepper to taste and then serve."
    ],
    "Ingredients": [
      "Tuna. Albacore tuna fish. Drained.",
      "Beans. Use your favorite kind, or even chickpeas. Rinsed.",
      "Tomatoes. Cherry or grape works well, cut into pieces.",
      "Cucumbers. Peeled and cubed.",
      "Parsley. Fresh is best. Chopped.",
      "Lemon Juice. Adds a zesty flavor.",
      "Salt \u0026 Pepper. To taste.",
      "Oil. Olive oil or your favorite kind.",
      "Bell Pepper"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Salad",
      "Healthy",
      "Tuna",
      "Green"
    ],
    "ImageCaption": null,
    "Img": "https://cooktoria.com/wp-content/uploads/2021/06/healthy-tuna-salad-sq-1.jpg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 22,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "Crispy Vietnamese Crepe",
    "Description": "The distinctive fresh flavors of Vietnam are showcased in this tasty crepe.",
    "Instructions": [
      "Combine flours, turmeric, salt and a pinch of pepper in a bowl. Add coconut milk and iced water. Stir until smooth. Cover. Refrigerate for 1 hour to rest.",
      "Heat 2 teaspoons oil in a 22cm (base) non-stick frying pan over medium-high heat. Add mince. Cook, stirring with a wooden spoon to break up mince, for 4 minutes or until browned. Add fish sauce and remaining pinch of pepper. Cook for 2 minutes or until fish sauce has almost evaporated. Remove from heat. Add half the onion. Stir to combine. Wipe the pan clean.",
      "Add remaining onion to batter. Brush pan with half the remaining oil. Heat over medium-high heat. Add half the batter to pan. Tilt pan, swirling batter to cover base and slightly up the side. Cook for 4 minutes or until base is golden. Place half the mince mixture and half the prawn on half the pancake. Top with half the sprouts and mint. Fold over to enclose. Transfer to a plate. Repeat with remaining ingredients.",
      "Cut each pancake into thirds. Serve with Nuoc cham."
    ],
    "Ingredients": [
      "Nuoc cham sauce",
      "2 pinches ground white pepper",
      "1/2 tsp ground turmeric",
      "1 tbsp cornflour",
      "1/2 cup iced water",
      "2 tbsp fish sauce",
      "2 green onions, thinly sliced diagonally",
      "500g medium cooked prawns, peeled, deveined, chopped",
      "1/2 cup snow pea sprouts, trimmed",
      "1/4 cup fresh mint leaves"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Vietnamese",
      "Egg",
      "Crepe",
      "Lunch"
    ],
    "ImageCaption": null,
    "Img": "https://img.taste.com.au/oWoaSY0W/taste/2016/11/crispy-vietnamese-pancakes-89654-1.jpeg",
    "Comments": [],
    "Reactions": null
  },
  {
    "Deleted": false,
    "RecipeID": 23,
    "AuthorID": 0,
    "FirstName": null,
    "LastName": null,
    "Title": "Thai Mango Sticky Rice",
    "Description": "This popular Thai dessert of Mango Sticky Rice is made of creamy glutinous rice paired with sweet ripe mangoes, then drizzled with a yummy coconut sauce! A filling summer dessert made with 6 ingredients only.",
    "Instructions": [
      "Rinse and drain glutinous rice in tap water several times until water becomes clear, to remove starch. Transfer to a bowl and soak in enough water for at least an hour or overnight.",
      "Drain the water and transfer the rice in a steamer basket lined with a cheese or muslin cloth. Add 4 pieces of pandan leaves. Place the steamer basket over the pot with boiling water. Steam for 15-20 minutes or until rice becomes translucent and cooked. Remove pandan leaves and transfer rice to a large bowl and fluff it several times using a spoon so they will not lump together. Cover and rest for 5 minutes.",
      "Meanwhile, in a large pot or deep pan, combine coconut milk, sugar and salt. Bring to a gentle simmer over medium heat. Turn off the heat once it simmers and sugar is completely dissolved. Remove from the stove. Take ¼ cup of coconut cream and set aside for toppings.",
      "Pour half of the remaining hot coconut milk to the bowl of still steaming hot rice and gently toss until well combined. Gradually add more of coconut milk to the rice and stir. Do it gently to prevent rice from becoming mushy. You might need to use all the remaining coconut milk or not, the target is to have a grainy but slightly wet and sticky porridge texture. Remember that the hot rice will continue to absorb the liquid as it cools down. Cover the bowl with plastic wrap so the top will not dry out.",
      "Return the reserved ¼ cup of coconut cream to the saucepan and add the cornstarch slurry. Cook over low heat stirring constantly until it thickens a bit. Remove pan from heat and transfer the sauce to a bowl or milk pourer for serving later.",
      "Return the reserved ¼ cup of coconut cream to the saucepan and add the cornstarch slurry. Cook over low heat stirring constantly until it thickens a bit. Remove pan from heat and transfer the sauce to a bowl or milk pourer for serving later.",
      "Assembly: Fill a small cup with sticky rice and invert it into a plate or bowl. Add slices of mangoes on the side. Pour some coconut cream sauce on top of the rice and mango slices or serve it in a saucer as a dip. Sprinkle with some roasted sesame seeds"
    ],
    "Ingredients": [
      "1 cup glutinous rice",
      "1 pieces pandan leaves -cut into 3 inch pieces optional",
      "1 can Coconut cream (400ml)",
      "¼ cup granulated sugar",
      "1-2 pieces ripe mangoes",
      "½ teaspoon cornstarch - dissolved in 1 teaspoonof water"
    ],
    "PublishDate": null,
    "EditDate": null,
    "Tags": [
      "Dessert",
      "Thai"
    ],
    "ImageCaption": null,
    "Img": "https://www.foxyfolksy.com/wp-content/uploads/2021/06/thai-mango-sticky-rice.jpg",
    "Comments": [],
    "Reactions": null
  }
]